app/views/layouts/shared/_header.html.erb

SELECT  "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <%= link_to 'Back', root_path, class: "btn btn-outline-secondary mx-2" %>
        <%= link_to 'DOWNLOAD PDF', statistic_path(Statistic.find(params[:id]), format: :pdf), class: "btn btn-outline-success my-2 my-sm-0" %>