app/controllers/application_forms_controller.rb

  def index
    @application_forms = ApplicationForm.all
---
SELECT "application_forms".* FROM "application_forms"