app/controllers/statistics_controller.rb

  def index
    @statistics = Statistic.all
---
SELECT "statistics".* FROM "statistics"

  def show
    @statistic = Statistic.find(params[:id])
---
SELECT  "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @statistic = Statistic.new(statistic_params)

    respond_to do |format|
      if @statistic.save
---
INSERT INTO "statistics" ("no_of_treatments", "no_of_samples", "analytical_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["no_of_treatments", 5], ["no_of_samples", 6], ["analytical_type", "sum"], ["created_at", "2020-04-10 11:07:41.342597"], ["updated_at", "2020-04-10 11:07:41.342597"]]

  def update
    respond_to do |format|
      if @statistic.update(statistic_params)
---
UPDATE "statistics" SET "updated_at" = $1 WHERE "statistics"."id" = $2  [["updated_at", "2020-04-10 11:07:41.345012"], ["id", 2]]

  def delete_excel_attachment
    @statistic = Statistic.find(params[:statistic_id])
---
SELECT  "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def result_excel_analysis
    # binding.pry
    @statistic = Statistic.find(params[:statistic_id])
---
SELECT  "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_statistic
      @statistic = Statistic.find(params[:id])
---
SELECT  "statistics".* FROM "statistics" WHERE "statistics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]